gjericksonSTW/SmartTorqueFW/board/pin_mux.h
/* PORTA2 (number 24), J1[4]/D1/UART0_TX */
#define BOARD_DEBUG_UART0_TX_PERIPHERAL                                  LPUART0   /*!< Device name: LPUART0 */
#define BOARD_DEBUG_UART0_TX_SIGNAL                                           TX   /*!< LPUART0 signal: TX */
#define BOARD_DEBUG_UART0_TX_PIN_NAME                                 LPUART0_TX   /*!< Pin name */
#define BOARD_DEBUG_UART0_TX_LABEL                           "J1[4]/D1/UART0_TX"   /*!< Label */
#define BOARD_DEBUG_UART0_TX_NAME                               "DEBUG_UART0_TX"   /*!< Identifier name */
#define BOARD_DEBUG_UART0_TX_DIRECTION                  kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/* USB0_DP (number 5), J10[3]/USB_DP */
#define BOARD_USB0_DP_PERIPHERAL                                            USB0   /*!< Device name: USB0 */
#define BOARD_USB0_DP_SIGNAL                                                  DP   /*!< USB0 signal: DP */
#define BOARD_USB0_DP_PIN_NAME                                           USB0_DP   /*!< Pin name */
#define BOARD_USB0_DP_LABEL                                      "J10[3]/USB_DP"   /*!< Label */
#define BOARD_USB0_DP_NAME                                             "USB0_DP"   /*!< Identifier name */

/* USB0_DM (number 6), J10[2]/USB_DM */
#define BOARD_USB0_DM_PERIPHERAL                                            USB0   /*!< Device name: USB0 */
#define BOARD_USB0_DM_SIGNAL                                                  DM   /*!< USB0 signal: DM */
#define BOARD_USB0_DM_PIN_NAME                                           USB0_DM   /*!< Pin name */
#define BOARD_USB0_DM_LABEL                                      "J10[2]/USB_DM"   /*!< Label */
#define BOARD_USB0_DM_NAME                                             "USB0_DM"   /*!< Identifier name */

/* VREGIN (number 8), KL43Z_REGIN */
#define BOARD_VREGIN_PERIPHERAL                                             USB0   /*!< Device name: USB0 */
#define BOARD_VREGIN_SIGNAL                                               VREGIN   /*!< USB0 signal: VREGIN */
#define BOARD_VREGIN_PIN_NAME                                             VREGIN   /*!< Pin name */
#define BOARD_VREGIN_LABEL                                         "KL43Z_REGIN"   /*!< Label */
#define BOARD_VREGIN_NAME                                               "VREGIN"   /*!< Identifier name */

/* PORTC0 (number 43), J1[5]/I2S_TXD/LCD_P20 */
#define BOARD_USB_SOF_OUT_PERIPHERAL                                        USB0   /*!< Device name: USB0 */
#define BOARD_USB_SOF_OUT_SIGNAL                                         SOF_OUT   /*!< USB0 signal: SOF_OUT */
#define BOARD_USB_SOF_OUT_PIN_NAME                                   USB_SOF_OUT   /*!< Pin name */
#define BOARD_USB_SOF_OUT_LABEL                          "J1[5]/I2S_TXD/LCD_P20"   /*!< Label */
#define BOARD_USB_SOF_OUT_NAME                                     "USB_SOF_OUT"   /*!< Identifier name */

/* PORTA5 (number 27), J1[12]/D5/I2S_TX_BCLK */
#define BOARD_I2S0_TX_BCLK_PERIPHERAL                                       USB0   /*!< Device name: USB0 */
#define BOARD_I2S0_TX_BCLK_SIGNAL                                          CLKIN   /*!< USB0 signal: CLKIN */
#define BOARD_I2S0_TX_BCLK_PIN_NAME                                    USB_CLKIN   /*!< Pin name */
#define BOARD_I2S0_TX_BCLK_LABEL                         "J1[12]/D5/I2S_TX_BCLK"   /*!< Label */
#define BOARD_I2S0_TX_BCLK_NAME                                   "I2S0_TX_BCLK"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

/* PORTE24 (number 20), U2[7]/U10[4]/I2C0_SCL */
#define BOARD_I2C0_SCL_PERIPHERAL                                           I2C0   /*!< Device name: I2C0 */
#define BOARD_I2C0_SCL_SIGNAL                                                SCL   /*!< I2C0 signal: SCL */
#define BOARD_I2C0_SCL_PIN_NAME                                         I2C0_SCL   /*!< Pin name */
#define BOARD_I2C0_SCL_LABEL                             "U2[7]/U10[4]/I2C0_SCL"   /*!< Label */
#define BOARD_I2C0_SCL_NAME                                           "I2C0_SCL"   /*!< Identifier name */

/* PORTE25 (number 21), U2[6]/U10[6]/I2C0_SDA */
#define BOARD_I2C1_SDA_PERIPHERAL                                           I2C0   /*!< Device name: I2C0 */
#define BOARD_I2C1_SDA_SIGNAL                                                SDA   /*!< I2C0 signal: SDA */
#define BOARD_I2C1_SDA_PIN_NAME                                         I2C0_SDA   /*!< Pin name */
#define BOARD_I2C1_SDA_LABEL                             "U2[6]/U10[6]/I2C0_SDA"   /*!< Label */
#define BOARD_I2C1_SDA_NAME                                           "I2C1_SDA"   /*!< Identifier name */

/* PORTD1 (number 58), U2[9]/U10[9]/INT2_ACCEL/INT1_MAG/LCD_P41 */
#define BOARD_INT2_ACCEL_GPIO                                              GPIOD   /*!< GPIO device name: GPIOD */
#define BOARD_INT2_ACCEL_PORT                                              PORTD   /*!< PORT device name: PORTD */
#define BOARD_INT2_ACCEL_GPIO_PIN                                             1U   /*!< PORTD pin index: 1 */
#define BOARD_INT2_ACCEL_PIN_NAME                                           PTD1   /*!< Pin name */
#define BOARD_INT2_ACCEL_LABEL        "U2[9]/U10[9]/INT2_ACCEL/INT1_MAG/LCD_P41"   /*!< Label */
#define BOARD_INT2_ACCEL_NAME                                       "INT2_ACCEL"   /*!< Identifier name */
#define BOARD_INT2_ACCEL_DIRECTION                       kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTC5 (number 54), J1[15]/I2S_RXD/INT1_ACCEL/LCD_P25 */
#define BOARD_INT1_ACCEL_GPIO                                              GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_INT1_ACCEL_PORT                                              PORTC   /*!< PORT device name: PORTC */
#define BOARD_INT1_ACCEL_GPIO_PIN                                             5U   /*!< PORTC pin index: 5 */
#define BOARD_INT1_ACCEL_PIN_NAME                                           PTC5   /*!< Pin name */
#define BOARD_INT1_ACCEL_LABEL               "J1[15]/I2S_RXD/INT1_ACCEL/LCD_P25"   /*!< Label */
#define BOARD_INT1_ACCEL_NAME                                       "INT1_ACCEL"   /*!< Identifier name */
#define BOARD_INT1_ACCEL_DIRECTION                       kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL_I2C(void);

/* PORTA18 (number 32), EXTAL_32KHZ */
#define BOARD_EXTAL_32KHZ_PERIPHERAL                                        OSC0   /*!< Device name: OSC0 */
#define BOARD_EXTAL_32KHZ_SIGNAL                                          EXTAL0   /*!< OSC0 signal: EXTAL0 */
#define BOARD_EXTAL_32KHZ_PIN_NAME                                        EXTAL0   /*!< Pin name */
#define BOARD_EXTAL_32KHZ_LABEL                                    "EXTAL_32KHZ"   /*!< Label */
#define BOARD_EXTAL_32KHZ_NAME                                     "EXTAL_32KHZ"   /*!< Identifier name */

/* PORTA19 (number 33), XTAL_32KHZ */
#define BOARD_XTAL_32KHZ_PERIPHERAL                                         OSC0   /*!< Device name: OSC0 */
#define BOARD_XTAL_32KHZ_SIGNAL                                            XTAL0   /*!< OSC0 signal: XTAL0 */
#define BOARD_XTAL_32KHZ_PIN_NAME                                          XTAL0   /*!< Pin name */
#define BOARD_XTAL_32KHZ_LABEL                                      "XTAL_32KHZ"   /*!< Label */
#define BOARD_XTAL_32KHZ_NAME                                       "XTAL_32KHZ"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
